app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 2], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 5]]
---
  def destroy
  	# bookの情報を取得
  	book = Book.find(params[:book_id])
  	# その投稿内の削除対象のコメントを探して取得
  	comment = current_user.book_comments.find_by(book_id: book.id)
  	# comment.user_id = current_user.id
  	# comment.book_id = book.id
  	comment.destroy