app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @book = Book.new
    @user = current_user
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    #新規投稿をする
    @book2 = Book.find(params[:id])
    #自分の投稿の一覧表示をする
    @user = User.find(@book2.user_id)

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "データベース実践入門"], ["body", "データベースを学ぶ"], ["created_at", "2020-05-03 09:05:07.877076"], ["updated_at", "2020-05-03 09:05:07.877076"], ["user_id", 1]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params)
    # 投稿データを保存するには、Strong Parameters も必要
    @book.user_id = current_user.id
  	if @book.save
  	 redirect_to book_path(@book.id), notice: "You have creatad book successfully."
    else
     @user = current_user
     @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book = Book.find(params[:id])
    @user = User.find(@book.user_id)