app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    #特定のユーザーの情報を表示する
  	@book = Book.new
    #新規投稿をする
  	@books = Book.where(user_id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]

  def index
    @book = Book.new
    @user = current_user
    # @user = User.find(params[:id])
  	@users = User.all
---
SELECT "users".* FROM "users"