app/models/user.rb

INSERT INTO "relationships" ("follower_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["following_id", 2], ["created_at", "2020-05-04 04:55:30.783970"], ["updated_at", "2020-05-04 04:55:30.783970"]]
---
  def follow!(other_user)
    following_relationships.create!(following_id: other_user.id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 6]]
---
  def unfollow!(other_user)
    following_relationships.find_by(following_id: other_user.id).destroy